In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
plt.xkcd()

In [3]:
import sqlite3
conn = sqlite3.connect('Northwind_small.sqlite')
cursor = conn.cursor()
print("Opened database successfully")

Opened database successfully

In [4]:
for row in cursor.execute("SELECT name FROM sqlite_master WHERE type='table';"):
    print(row)

('Employee',)
('Category',)
('Customer',)
('Shipper',)
('Supplier',)
('Order',)
('Product',)
('OrderDetail',)
('CustomerCustomerDemo',)
('CustomerDemographic',)
('Region',)
('Territory',)
('EmployeeTerritory',)

In [ ]:
SELECT category
FROM table1
INNER JOIN table2
ON table1.column = table2.column

In [33]:
pd.read_sql_query("SELECT *FROM Product limit 3 ", conn)

,Id,ProductName,SupplierId,CategoryId,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19,17,40,25,0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10,13,70,25,0

In [23]:
pd.read_sql_query("SELECT * FROM OrderDetail limit 3", conn)

         Id  OrderId  ProductId  UnitPrice  Quantity  Discount
0  10248/11    10248         11       14.0        12       0.0
1  10248/42    10248         42        9.8        10       0.0
2  10248/72    10248         72       34.8         5       0.0

In [19]:
#pd.read_sql_query("SELECT Supplier.Id, Supplier.City, Supplier.Region, Supplier.Country, Product.CategoryId FROM Supplier INNER JOIN Product ON Supplier.ID = Product.SupplierID", conn)

In [44]:
demand = pd.read_sql_query("SELECT Discount,UnitsInStock , Discontinued FROM OrderDetail INNER JOIN Product ON OrderDetail.ProductId = Product.Id WHERE Product.Discontinued = 0", conn)

In [45]:
demand.head()

   Discount  UnitsInStock  Discontinued
0       0.0            22             0
1       0.0            14             0
2       0.0            35             0
3       0.0            20             0
4       0.0            85             0

In [46]:
demand.drop(labels="Discontinued", axis=1, inplace=True)

In [47]:
demand.head()

   Discount  UnitsInStock
0       0.0            22
1       0.0            14
2       0.0            35
3       0.0            20
4       0.0            85

In [58]:
demand_ctrl = demand[demand["Discount"] == 0]
demand_exp = demand[demand["Discount"] != 0]

      Discount  UnitsInStock
0          0.0            22
1          0.0            14
2          0.0            35
3          0.0            20
4          0.0            85
9          0.0            76
12         0.0            19
13         0.0             0
14         0.0            69
15         0.0            10
17         0.0             4
18         0.0            17
19         0.0            29
20         0.0           112
21         0.0            79
22         0.0            32
23         0.0            49
24         0.0            69
25         0.0            32
28         0.0             3
29         0.0            11
31         0.0            36
34         0.0             3
35         0.0            20
36         0.0            15
37         0.0            21
41         0.0            17
43         0.0            15
45         0.0           123
48         0.0            14
...        ...           ...
1864       0.0            19
1865       0.0            19
1866       0.0            32
1867       0.0            19
1869       0.0           111
1872       0.0            85
1874       0.0             6
1877       0.0            29
1878       0.0            25
1879       0.0           111
1880       0.0            85
1883       0.0            69
1887       0.0             0
1890       0.0            17
1891       0.0            85
1892       0.0            65
1893       0.0            22
1894       0.0            22
1903       0.0            13
1904       0.0            53
1908       0.0            31
1910       0.0            24
1914       0.0            61
1915       0.0             9
1917       0.0            85
1919       0.0            38
1920       0.0           115
1923       0.0             4
1925       0.0           125
1926       0.0            32

[1175 rows x 2 columns]